## 중복 데이터 삭제하기

In [1]:
import pandas as pd

In [12]:
student_list = [
    {'name': 'John', 'major': 'Computer Science', 'sex': 'male'},
    {'name': 'Nate', 'major': 'Computer Science', 'sex': 'male'},
    {'name': 'Edward', 'major': 'Computer Science', 'sex': 'male'},
    {'name': 'Zara', 'major': 'Phychology', 'sex': 'female'},
    {'name': 'John', 'major': 'Computer Science', 'sex': 'male'}
]
df = pd.DataFrame(student_list, columns=['name', 'major', 'sex'])
df

     name             major     sex
0    John  Computer Science    male
1    Nate  Computer Science    male
2  Edward  Computer Science    male
3    Zara        Phychology  female
4    John  Computer Science    male

In [13]:
# 중복체크(column이 지정되어 있지 않으면 전체 데이터가 일치하는지 체크함)
df.duplicated()

0    False
1    False
2    False
3    False
4     True
dtype: bool

In [14]:
# 중복 제거된 DataFrame을 반환
# 중복된 데이터 중 첫번째 데이터가 유지되고 나머지 중복 행이 제거됨

# 어떤 중복데이터를 유지할지는 keep 옵션으로 지정할 수 있음
# keep option
#  - 'first' : 첫번째 중복데이터 유지
#  - 'last' : 마지막 중복데이터 유지
#  - False : 중복 데이터 전부 제거
df.drop_duplicates()

     name             major     sex
0    John  Computer Science    male
1    Nate  Computer Science    male
2  Edward  Computer Science    male
3    Zara        Phychology  female

In [15]:
df.drop_duplicates(keep='last')

     name             major     sex
1    Nate  Computer Science    male
2  Edward  Computer Science    male
3    Zara        Phychology  female
4    John  Computer Science    male

In [16]:
df.drop_duplicates(keep=False)

     name             major     sex
1    Nate  Computer Science    male
2  Edward  Computer Science    male
3    Zara        Phychology  female

## 특정 컬럼으로 중복제거

In [18]:
student_list = [
    {'name': 'John', 'major': 'Computer Science', 'sex': 'male'},
    {'name': 'Nate', 'major': 'Computer Science', 'sex': 'male'},
    {'name': 'Edward', 'major': 'Computer Science', 'sex': 'male'},
    {'name': 'Zara', 'major': 'Phychology', 'sex': 'female'},
    {'name': 'Wendy', 'major': 'Economics', 'sex': 'female'},
    {'name': 'Nate', 'major': None, 'sex': 'male'},
    {'name': 'John', 'major': 'Economics', 'sex': 'male'}
]
df = pd.DataFrame(student_list, columns=['name', 'major', 'sex'])

In [19]:
# 중복체크
df.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
dtype: bool

In [20]:
# 특정 column으로 중복체크
df.duplicated(['name'])

0    False
1    False
2    False
3    False
4    False
5     True
6     True
dtype: bool

In [21]:
df.drop_duplicates(['name'], keep='last')

     name             major     sex
2  Edward  Computer Science    male
3    Zara        Phychology  female
4   Wendy         Economics  female
5    Nate              None    male
6    John         Economics    male